
 

#define BX_RF 0x40  // выбор источника опорного напр€жени€(внеш -0x40\внутр -0)ј÷ѕ  
#define BX_MD  0x2A //рещим запуска ј÷ѕ (2ј - однократное измерение в режиме Chop Disable)
#define BX_CON1 0x27 //unipol преобразование 2.5v 
#define BX_SF   0x14//0x08 //4.3 мкс//0x10 //7.9 мкс//0x14  - 9.8мкс//0x07  //0x03 // врем€ преобразовани€ 0.73мс

#define bx_sf1   0x03 //0x03
//#define ADR_BASE_CH 0x60 //начальный адрес таблицы расположени€ каналов

//начальный адрес таблицы размещени€ результатов измерени€  измерени€ (EEPROM 3страница)
#define ADR_TAB_DAT  0x7C0  //-43F
//начальный адрес таблицы режимов измерени€ (EEPROM 3страница адрес 80h) 
#define ADR_TAB_IZM 0x780 //-47F
//начальный адрес таблицы описани€ аналог.каналов (EEPROM 3страница adres A0)
#define ADR_TAB_CH   0x680  // - 4FF
//начальный адрес таблицы преобразовани€ (EEPROM 4,5страницы)
#define ADR_TAB_PHIZ 0x400 //-7FF
#define ADR_TAB_PRG  0x5E0 // - 61Fначальный адрес таблицы порогов (EEPROM 6страница)
#define ADR_TAB_IZM_ZCH  0x6F0 
// - начальный адрес таблицы описани€ цифровых каналов)

/*-----макрос MAC_Copy_Epr_Ram_TAB_ALL
копирование таблиц а EEPROM (адрес 0x0400)
в XRAM(адрес RAM = 0x0400)
–азмер таблицы 1kбайт
*/
#define MAC_Copy_Epr_Ram_TAB_ALL(ADR_EP,ADR_MEM) { \
ADR_E = (ADR_EP -0x100)>>2 ; \
tmpadc=ADR_MEM;   \
for(i1=0;i1<128;i1=i1+2)  \
{                      \
FUM_Epr_Rd4(ADR_E)  \ 
CM1=(EDATA1<<8)|EDATA2;CM2=(EDATA3<<8)|EDATA4; \
*((int xdata*)tmpadc+i1) =CM1; \
*((int xdata*)tmpadc+i1+1) =CM2;  \
ADR_E ++;                        \
}                  \
}

/*-----макрос MAC_Copy_Epr_Ram_
копирование таблиц а EEPROM (адрес )
в XRAM(адрес RAM )
–азмер таблицы (L_DAT)
*/
#define MAC_Copy_Epr_Ram(ADR_EP,ADR_MEM,L_DAT) { \
ADR_E = (ADR_EP -0x100)>>2 ; \
tmpadc=ADR_MEM;   \
for(i1=0;i1<L_DAT;i1=i1+2)  \
{                      \
FUM_Epr_Rd4(ADR_E)  \ 
CM1=(EDATA1<<8)|EDATA2;CM2=(EDATA3<<8)|EDATA4; \
*((int xdata*)tmpadc+i1) =CM1; \
*((int xdata*)tmpadc+i1+1) =CM2;  \
ADR_E ++;                        \
}                  \
}


//-----------------------------  


/*---MAC_DFN_DAT_PRG
макрос определение значени€ порога измеренного аналогового параметра
по заданной таблице пороговых значений ,размещенной в рабочем буфере
 BX[] RAM (адрес 0x0430)
//------структура таблиц преобразовани€
4байтный заголовок три 4байтных значений дл€ каждого параметра,
 опируетс€ в рабочий буфер по им€ни параметра одна из таблиц
FL_PORG[8]
wadc = Str_BX_A[N_CH].ZGL_BX_A[1] & 0x0F0; \
if((wadc&0x80)==0x80) \
{wadc=wadc<<2; \
if(wadc1==wadc) {FL_PORG[N_CH]=10;FL_ERR=1;} \
*/


#define FUM_Epr_Rd4(Eadr) {	EA=0; \
        EADRH=(Eadr>>8)&0x03; EADRL=Eadr;ECON=0x01;EADRH=0;\
		EA=1; \
                   }
/*-----------------------------------------------------------------------*/
/*------------------------------------------------------------------*/

#define FUM_Epr_Wr4(Eadr,d1,d2,d3,d4) {	 EA=0; \
     EADRH=(Eadr>>8)&0x03; EADRL=Eadr;ECON=0x01;\
     EDATA1=d1;EDATA2=d2;EDATA3=d3;EDATA4=d4;ECON=0x05;ECON=0x02;\
     EADRH=0; \ 
	 EA=1; \
	              }
/*-------------------------------------------------------------*/
/*--------------------------------------------------------------
// 
//это вызов MACRO_определени€ функции загрузки режима работы ј÷ѕ
 CH = 5;MD = 6;BX_CH =7; 
BX_RF =0x40;   
BX_CON1 = 0x27;  BX_SF = 0x03;BX_MD = 0x22;  
------------------------------------------------------------------*/


/*макрос вычисление физического значени€ по таблице описани€
из рабочего буфера BX[].код измеренного значени€ - рабочий параметр BX_KOD
A_TKH - указатель на начало таблицы в буфере BX[A_TKH]
BX[0] - 4байта заголовок. 3,4байты заголовка - длина таблицы
BX[i] (i=4,6,..) - значени€ кода 1 2 3 ..N точек 
BX[i] (i=5,7,..) - физические значени€ 1 2 3 ..N точек 
 */ 

 





    



